joshuachan6988/STM32F429I-DISCO---Beginner-Code/FreeRTOS_ON/Src/main.c
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{

  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */ 
}

/* LED_Toggle function */
void LED_Toggle(void const * argument)
{
  /* USER CODE BEGIN LED_Toggle */
  /* Infinite loop */
  for(;;)
  {
		/* Suspend LED_Toggle */
		osThreadSuspend(NULL);
		/* Toggle LED State */
		BSP_LED_Toggle(LED3);
  }
  /* USER CODE END LED_Toggle */
}

/* SCREEN_Toggle function */
void SCREEN_Toggle(void const * argument)
{
  /* USER CODE BEGIN SCREEN_Toggle */
	int count;
  /* Infinite loop */
  for(count = 0;; count = (count + 1) % 2)
  {
		/* Suspend SCREEN_Toggle */
		osThreadSuspend(NULL);
		/* Toggle the Scren */
		if(count == 0)
		{
			/* BGC Red to White */
			/* LCD background color */
			BSP_LCD_Clear(LCD_COLOR_RED);
			/* Text background color */
			BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
			/* Text color */
			BSP_LCD_SetTextColor(LCD_COLOR_RED);
			/* LCD Title Show */
			BSP_LCD_DisplayStringAt(0, 40, "FreeRTOS", CENTER_MODE);
			/* Make the Botton to be Red */
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			BSP_LCD_DrawCircle(120, 180, 30);
			BSP_LCD_FillCircle(120, 180, 30);
		}
		else
		{
			/* BGC White to Red */
			/* LCD background color */
			BSP_LCD_Clear(LCD_COLOR_WHITE);
			/* Text background color */
			BSP_LCD_SetBackColor(LCD_COLOR_RED);
			/* Text color */
			BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			/* LCD Title Show */
			BSP_LCD_DisplayStringAt(0, 40, "FreeRTOS", CENTER_MODE);
			/* Make the Botton to be Red */
			BSP_LCD_SetTextColor(LCD_COLOR_RED);
			BSP_LCD_DrawCircle(120, 180, 30);
			BSP_LCD_FillCircle(120, 180, 30);
		}
		/* Resume TOUCH_Detect */
		osThreadResume(TOUCHHandle);
  }
  /* USER CODE END SCREEN_Toggle */
}

/* TOUCH_Detect function */
void TOUCH_Detect(void const * argument)
{
  /* USER CODE BEGIN TOUCH_Detect */
	static TS_StateTypeDef  TS_State;
	static uint32_t x = 0, y = 0;
	
  /* Infinite loop */
  for(;;)
  {
		/* Get touch screen position */
		BSP_TS_GetState(&TS_State);
		x = TS_State.X;
		y = TS_State.Y;
		/* Checks if touch is detected */
		if(TS_State.TouchDetected)
		{
			if(y >= 160 & y <= 200)
			{
				/* Checks if 1st button is pressed */
				if(x >= 100 & x <= 140) 
				{
					//BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
					//BSP_LCD_DisplayStringAt(0, 40, "FreeRTOS", CENTER_MODE);
					/* Resume LED_Toggle */
					osThreadResume(LED_1Handle);
					/* Resume SCREEN_Toggle */
					osThreadResume(SCREENHandle);
					/* Suspend TOUCH_Detect */
					osThreadSuspend(NULL);
					/* Prevent Multiple Touch */
					osDelay(100);
				}
			}
		}
    osDelay(10);
  }
  /* USER CODE END TOUCH_Detect */
}

/* LED_Blink function */
void LED_Blink(void const * argument)
{
  /* USER CODE BEGIN LED_Blink */
  /* Infinite loop */
  for(;;)
  {
		BSP_LED_Toggle(LED4);
    osDelay(1000);
  }
  /* USER CODE END LED_Blink */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
